; domain
; IPC5 Domain: Trucks Propositional
; Authors: Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti 

(define (domain Trucks) 
(:requirements :typing :adl)  

(:types truckarea time location locatable - object
        truck package - locatable) 

(:predicates (at ?x - locatable ?l - location) 	     
             (in ?p - package ?t - truck ?a - truckarea) 	     
             (connected ?x ?y - location)
             (free ?a - truckarea ?t - truck)
  	     (time-now ?t - time)
 	     (next ?t1 - time ?t2 - time)
	     (le ?t1 - time ?t2 - time)
 	     (delivered ?p - package ?l - location ?t - time)
	     (at-destination ?p - package ?l - location)
 	     (closer ?a1 - truckarea ?a2 - truckarea))

(:action load
 :parameters (?p - package ?t - truck ?a1 - truckarea ?l - location)
 :precondition (and (at ?t ?l) (at ?p ?l) (free ?a1 ?t)
  		    (forall (?a2 - truckarea)
  			    (imply (closer ?a2 ?a1) (free ?a2 ?t))))
 :effect (and (not (at ?p ?l)) (not (free ?a1 ?t)) (in ?p ?t ?a1)))

(:action unload
 :parameters (?p - package ?t - truck ?a1 - truckarea ?l - location)
 :precondition (and (at ?t ?l) (in ?p ?t ?a1)
  		    (forall (?a2 - truckarea)
  			    (imply (closer ?a2 ?a1) (free ?a2 ?t))))
 :effect (and (not (in ?p ?t ?a1)) (free ?a1 ?t) (at ?p ?l)))

(:action drive
 :parameters (?t - truck ?from ?to - location ?t1 ?t2 - time)
 :precondition (and (at ?t ?from) (connected ?from ?to) 
		    (time-now ?t1) (next ?t1 ?t2))
 :effect (and (not (at ?t ?from)) (not (time-now ?t1)) 
	      (time-now ?t2) (at ?t ?to)))

(:action deliver
 :parameters (?p - package ?l - location ?t1 ?t2 - time)
 :precondition (and (at ?p ?l) (time-now ?t1) (le ?t1 ?t2))
 :effect (and (not (at ?p ?l)) (delivered ?p ?l ?t2) (at-destination ?p ?l)))

)

; problem
; Domain designed by Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem truck-725)
(:domain Trucks)
(:objects
	truck1 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	l1 - location
	l2 - location
	l3 - location
	t0 - time
	t1 - time
	t2 - time
	t3 - time
	t4 - time
	t5 - time
	t6 - time
	t7 - time
	t8 - time
	t9 - time
	a1 - truckarea
	a2 - truckarea
	a3 - truckarea)

(:init
	(at truck1 l3)
	(free a1 truck1)
	(free a2 truck1)
	(free a3 truck1)
	(closer a1 a2)
	(closer a1 a3)
	(closer a2 a3)
	(at package1 l3)
	(at package2 l3)
	(at package3 l3)
	(at package4 l1)
	(at package5 l1)
	(at package6 l1)
	(at package7 l3)
	(at package8 l3)
	(connected l1 l2)
	(connected l1 l3)
	(connected l2 l1)
	(connected l2 l3)
	(connected l3 l1)
	(connected l3 l2)
	(time-now t0)
	(le t1 t1)
	(le t1 t2)
	(le t1 t3)
	(le t1 t4)
	(le t1 t5)
	(le t1 t6)
	(le t1 t7)
	(le t1 t8)
	(le t1 t9)
	(le t2 t2)
	(le t2 t3)
	(le t2 t4)
	(le t2 t5)
	(le t2 t6)
	(le t2 t7)
	(le t2 t8)
	(le t2 t9)
	(le t3 t3)
	(le t3 t4)
	(le t3 t5)
	(le t3 t6)
	(le t3 t7)
	(le t3 t8)
	(le t3 t9)
	(le t4 t4)
	(le t4 t5)
	(le t4 t6)
	(le t4 t7)
	(le t4 t8)
	(le t4 t9)
	(le t5 t5)
	(le t5 t6)
	(le t5 t7)
	(le t5 t8)
	(le t5 t9)
	(le t6 t6)
	(le t6 t7)
	(le t6 t8)
	(le t6 t9)
	(le t7 t7)
	(le t7 t8)
	(le t7 t9)
	(le t8 t8)
	(le t8 t9)
	(le t9 t9)
	(next t0 t1)
	(next t1 t2)
	(next t2 t3)
	(next t3 t4)
	(next t4 t5)
	(next t5 t6)
	(next t6 t7)
	(next t7 t8)
	(next t8 t9))

(:goal (and 
	(delivered package1 l1 t3)
	(at-destination package2 l2)
	(delivered package3 l2 t3)
	(at-destination package4 l3)
	(delivered package5 l3 t6)
	(delivered package6 l3 t6)
	(at-destination package7 l2)
	(at-destination package8 l2)))



)

; plan
1. (load package2 truck1 a2 l3)
   deleted: (at package2 l3) (free a2 truck1)
   added: (in package2 truck1 a2)
   goals met: 0 of 8
2. (load package1 truck1 a1 l3)
   deleted: (at package1 l3) (free a1 truck1)
   added: (in package1 truck1 a1)
   goals met: 0 of 8
3. (drive truck1 l3 l1 t0 t1)
   deleted: (at truck1 l3) (time-now t0)
   added: (time-now t1) (at truck1 l1)
   goals met: 0 of 8
4. (unload package1 truck1 a1 l1)
   deleted: (in package1 truck1 a1)
   added: (free a1 truck1) (at package1 l1)
   goals met: 0 of 8
5. (deliver package1 l1 t1 t3)
   deleted: (at package1 l1)
   added: (delivered package1 l1 t3) (at-destination package1 l1)
   goals met: 1 of 8
6. (load package6 truck1 a1 l1)
   deleted: (at package6 l1) (free a1 truck1)
   added: (in package6 truck1 a1)
   goals met: 1 of 8
7. (drive truck1 l1 l3 t1 t2)
   deleted: (at truck1 l1) (time-now t1)
   added: (time-now t2) (at truck1 l3)
   goals met: 1 of 8
8. (unload package6 truck1 a1 l3)
   deleted: (in package6 truck1 a1)
   added: (free a1 truck1) (at package6 l3)
   goals met: 1 of 8
9. (deliver package6 l3 t2 t6)
   deleted: (at package6 l3)
   added: (delivered package6 l3 t6) (at-destination package6 l3)
   goals met: 2 of 8
10. (load package3 truck1 a1 l3)
   deleted: (at package3 l3) (free a1 truck1)
   added: (in package3 truck1 a1)
   goals met: 2 of 8
11. (drive truck1 l3 l2 t2 t3)
   deleted: (at truck1 l3) (time-now t2)
   added: (time-now t3) (at truck1 l2)
   goals met: 2 of 8
12. (unload package3 truck1 a1 l2)
   deleted: (in package3 truck1 a1)
   added: (free a1 truck1) (at package3 l2)
   goals met: 2 of 8
13. (unload package2 truck1 a2 l2)
   deleted: (in package2 truck1 a2)
   added: (free a2 truck1) (at package2 l2)
   goals met: 2 of 8
14. (deliver package3 l2 t3 t3)
   deleted: (at package3 l2)
   added: (delivered package3 l2 t3) (at-destination package3 l2)
   goals met: 3 of 8
15. (deliver package2 l2 t3 t3)
   deleted: (at package2 l2)
   added: (delivered package2 l2 t3) (at-destination package2 l2)
   goals met: 4 of 8
16. (drive truck1 l2 l1 t3 t4)
   deleted: (at truck1 l2) (time-now t3)
   added: (time-now t4) (at truck1 l1)
   goals met: 4 of 8
17. (load package4 truck1 a2 l1)
   deleted: (at package4 l1) (free a2 truck1)
   added: (in package4 truck1 a2)
   goals met: 4 of 8
18. (load package5 truck1 a1 l1)
   deleted: (at package5 l1) (free a1 truck1)
   added: (in package5 truck1 a1)
   goals met: 4 of 8
19. (drive truck1 l1 l3 t4 t5)
   deleted: (at truck1 l1) (time-now t4)
   added: (time-now t5) (at truck1 l3)
   goals met: 4 of 8
20. (unload package5 truck1 a1 l3)
   deleted: (in package5 truck1 a1)
   added: (free a1 truck1) (at package5 l3)
   goals met: 4 of 8
21. (unload package4 truck1 a2 l3)
   deleted: (in package4 truck1 a2)
   added: (free a2 truck1) (at package4 l3)
   goals met: 4 of 8
22. (deliver package5 l3 t5 t6)
   deleted: (at package5 l3)
   added: (delivered package5 l3 t6) (at-destination package5 l3)
   goals met: 5 of 8
23. (deliver package4 l3 t5 t5)
   deleted: (at package4 l3)
   added: (delivered package4 l3 t5) (at-destination package4 l3)
   goals met: 6 of 8
24. (load package7 truck1 a2 l3)
   deleted: (at package7 l3) (free a2 truck1)
   added: (in package7 truck1 a2)
   goals met: 6 of 8
25. (drive truck1 l3 l2 t5 t6)
   deleted: (at truck1 l3) (time-now t5)
   added: (time-now t6) (at truck1 l2)
   goals met: 6 of 8
26. (unload package7 truck1 a2 l2)
   deleted: (in package7 truck1 a2)
   added: (free a2 truck1) (at package7 l2)
   goals met: 6 of 8
27. (deliver package7 l2 t6 t6)
   deleted: (at package7 l2)
   added: (delivered package7 l2 t6) (at-destination package7 l2)
   goals met: 7 of 8
28. (drive truck1 l2 l3 t6 t7)
   deleted: (at truck1 l2) (time-now t6)
   added: (time-now t7) (at truck1 l3)
   goals met: 7 of 8
29. (load package8 truck1 a1 l3)
   deleted: (at package8 l3) (free a1 truck1)
   added: (in package8 truck1 a1)
   goals met: 7 of 8
30. (drive truck1 l3 l2 t7 t8)
   deleted: (at truck1 l3) (time-now t7)
   added: (time-now t8) (at truck1 l2)
   goals met: 7 of 8
31. (unload package8 truck1 a1 l2)
   deleted: (in package8 truck1 a1)
   added: (free a1 truck1) (at package8 l2)
   goals met: 7 of 8
32. (deliver package8 l2 t8 t8)
   deleted: (at package8 l2)
   added: (delivered package8 l2 t8) (at-destination package8 l2)
   goals met: 8 of 8
